Revit 2027 API
UIControlledApplication.CreateRibbonPanel Method
Overload List
Name | Description
CreateRibbonPanel(String) |  Create a new RibbonPanel on the Add-Ins tab.
CreateRibbonPanel(String, String) |  Create a new RibbonPanel on the specified tab.
CreateRibbonPanel(Tab, String) |  Create a new RibbonPanel on the designated standard Revit tab.
Top
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace